---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoRunsRamp
source: html/2cb9944e-2a5b-ceab-a196-7ea8b8a70b16.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoRunsRamp Property

Ramp has no Runs. Can't create Ramp.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoRunsRamp { get; }
```